app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'R')
---
  def index
    @all_ratings=defrating
    @keys=[nil]
    rating=params[:ratings]
    sort=params[:sort]
    if(sort=='title' || sort=='release_date')
      @movies = Movie.order(sort)
      @sort=sort;
    elsif(rating.nil?)
      @movies = Movie.all
    else
      keys=rating.keys
      @keys=keys
      @movies = Movie.where(rating: keys)